Examinator/src/Catalogs/ВопросыСУЗ/ВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаРезультата</name>
    <type>
      <types>EnumRef.МетодыРасчетаРезультатаВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВарианты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасетныйВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <comment>Имя макета, которое задано в синониме перечисления</comment>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементActiveX</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенРазвернутыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьИменаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКатегорий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВариантовОтветов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаПодсказку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальноеРазмещениеВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВариантов</name>
    <type>
      <types>EnumRef.ОтображениеВариантовВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйВыводВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекста</name>
    <type>
      <types>CatalogRef.ШаблоныТекстаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьКомментарииКВариантамОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВариантыРаботыСПрограммойСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполняетсяПрограммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выделить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыВопросовСУЗ/ТипыВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВопросовСУЗ</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногихПсихологический</name>
  </enumValues>
  <enumValues>
    <name>МногиеИзМногихПсихологический</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/МетодыРасчетаРезультатаВопросаСУЗ/МетодыРасчетаРезультатаВопросаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыРасчетаРезультатаВопросаСУЗ</name>
  <enumValues>
    <name>ТочноеСовпадение</name>
  </enumValues>
  <enumValues>
    <name>ПроцентВерных</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ВопросыСУЗ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.question;			
	КонецЕсли;
	
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоГруппа Тогда
		
		// МетодРасчетаРезультата
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ЭлементActiveX
		 ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.Открытый
		 ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.РаботаВПрограмме Тогда
			МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ПустаяСсылка();
		КонецЕсли;
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ОдинИзМногих
		 ИЛИ ТипВопроса = Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
			МетодРасчетаРезультата = Перечисления.МетодыРасчетаРезультатаВопросаСУЗ.ТочноеСовпадение;
		КонецЕсли;
			
		// РазрешенРазвернутыйОтвет
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.Открытый Тогда
			РазрешенРазвернутыйОтвет = Истина;
		КонецЕсли;
		
		Если ТипВопроса = Перечисления.ТипыВопросовСУЗ.ЭлементActiveX Тогда
			РазрешенРазвернутыйОтвет = Ложь;
		КонецЕсли;
		
		// Устанавливаем реквизит "ФасетныйВопрос".
		
		Если ТипВопроса <> Перечисления.ТипыВопросовСУЗ.ОдинИзМногих
		   И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.МногиеИзМногих
		   И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.ПоШаблону Тогда
			ФасетныйВопрос = Ложь;
		КонецЕсли;
		
		// ПоследовательныйВыводВариантов
		
		Если ТипВопроса <> Перечисления.ТипыВопросовСУЗ.Таблица
		 И ТипВопроса <> Перечисления.ТипыВопросовСУЗ.Соответствие Тогда
			ПоследовательныйВыводВариантов = Ложь;
		КонецЕсли;
		
		// Очищаем значения параметров, заполняемых программой
		
		Для каждого СтрокаТЧ Из Параметры Цикл
		
			Если СтрокаТЧ.ЗаполняетсяПрограммой Тогда
				СтрокаТЧ.Значение = Неопределено;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
